package ru.gb.lesson3.hw;

import java.util.ArrayList;
import java.util.Collections;

public class Homeworks {

  // Задание 1
  public static int[] mergeSort(int[] a) {
    // Напишите свое решение ниже
    ArrayList<Integer> list = new ArrayList<>();
    // заполняем список элементами массива
    Collections.sort(list);
    // создаем массив и заполняем его элементами списка

    return null;
  }

  // Задание 2
  public static void removeEvenNumbers(Integer[] arr) {
    // Создать ArrayList<Integer> odd;
    // Проитерироваться по arr, все нечетные элементы добавить в список odd
    // Распечатать список методом System.out.println(odd);
  }

  // Задание 3
  public static void analyzeNumbers(Integer[] arr) {
    // Создать список numbers
    // Добавить в него все элементы массива
    // Отсортировать Collections.sort
    // Вывести на консоль System.out.println
    // Выводим минимальный (индекс 0)
    // Выводим максмальный (индекс size() - 1)
    // Посчитать сумму, разделить на длину и вывести среднее арифметическое
  }

}
